import './Documents.scss'

const documents = [
    {
        title: 'Шаблон для внесення в реєстр ветеранів',
        description: 'Цей шаблон використовується для внесення відомостей до Єдиного державного реєстру ветеранів війни, якщо є витяг з протоколу засідання комісії. Використовуйте його, якщо маєте інформацію про особу, яка перебуває в полоні.',
        link: '/files/Заява_на_Мінветеранів_Внесення_до_реєстру.docx',
    },
    {
        title: 'Шаблон для отримання інформації з ЄДРВВ',
        description: 'Шаблон заяви для запиту інформації з Єдиного державного реєстру ветеранів війни. Потрібно для отримання інформації  про надання моєму зниклому безвісти за особливих обставин статусу учасника бойових дій до Єдиного державного реєстру ветеранів війни',
        link: '/files/Зразок_заяви_про_надання_інформації_з_ЄДРВВ_безвісти_зниклого.docx',
    },
    {
        title: 'Заява на Лубінця',
        description: 'Зразок заяви, яку потрібно подати для звернення до Лубінця щодо осіб, що перебувають у полоні.',
        link: '/files/lubinec.docx',
    },
    {
        title: 'Заява на встановлення відповідності по фото',
        description: 'Шаблон заяви для встановлення відповідності особи на основі фото. Важливо подавати фото високої якості для офіційної експертизи.',
        link: '/files/Заява_про_портретну_експертизу_до_Уповноваженого_ВРУ.docx',
    },
    {
        title: 'Заява для Буданова',
        description: 'Документ для подачі заяви, якщо особа перебуває в полоні. Використовуйте цей шаблон для подачі офіційної заяви органам влади.',
        link: '/files/Буданову.docx',
    },
];

const DocumentsSection = () => {
    return (
        <div className="documents-section">
            <div className="documents-section-header">
                <h2 className="section-title">Як подати заяву щодо зниклих або постраждалих осіб</h2>
                <p className="section-description">
                    Цей розділ надає важливу інформацію та шаблони документів для подачі заяв щодо зниклих осіб або осіб, що постраждали внаслідок війни. Зразки документів включають звернення до органів державної влади.
                </p>
            </div>
            {documents.map((doc, index) => (
                <div className="document-item" key={index}>
                    <h3 className="document-title">{doc.title}</h3>
                    <p className="document-description">{doc.description}</p>
                    <a href={doc.link} className="download-link" target="_blank" rel="noopener noreferrer">
                        Завантажити {doc.title}
                    </a>
                </div>
            ))}

            <div className="instructions">
                <h3 className="instructions-title">Інструкції</h3>
                <p>1. Для подачі заяви на Лубінця або інших осіб заповніть відповідні поля в документах і подайте їх через офіційні канали.</p>
                <p>2. Для отримання підтвердження з фотографії вам потрібно подати фото високої якості. Якщо фото розмите або неякісне, вам можуть відмовити в наданні відповіді.</p>
            </div>
        </div>
    );
};

export default DocumentsSection;
