import './Documents.scss'

const documents = [
    {
        title: 'Шаблон для внесення в реєстр ветеранів',
        description: 'Цей шаблон використовується для внесення відомостей до Єдиного державного реєстру ветеранів війни, якщо є витяг з протоколу засідання комісії.',
        link: '/files/Заява_на_Мінветеранів_Внесення_до_реєстру.docx',
    },
    {
        title: 'Шаблон для отримання інформації з ЄДРВВ',
        description: 'Шаблон заяви для запиту інформації з Єдиного державного реєстру ветеранів війни. Потрібно для отримання інформації  про надання моєму зниклому безвісти за особливих обставин статусу учасника бойових дій до ЄДРВВ.',
        link: '/files/Зразок_заяви_про_надання_інформації_з_ЄДРВВ_безвісти_зниклого.docx',
    },
    {
        title: 'Заява на Лубінця',
        description: 'Зразок заяви, яку потрібно подати для звернення до Лубінця щодо осіб, що перебувають у полоні.',
        link: '/files/lubinec.docx',
    },
    {
        title: 'Заява на встановлення відповідності по фото',
        description: 'Шаблон заяви для встановлення відповідності особи на основі фото. Важливо подавати фото високої якості для офіційної експертизи.',
        link: '/files/Заява_про_портретну_експертизу_до_Уповноваженого_ВРУ.docx',
    },
    {
        title: 'Заява для Буданова',
        description: 'Документ для подачі заяви, якщо особа перебуває в полоні. Використовуйте цей шаблон для подачі офіційної заяви органам влади.',
        link: '/files/Буданову.docx',
    },
    {
        title: 'Шаблон листа до Генерального штабу ЗСУ (грошове питання)',
        description: 'Шаблон для звернення до Генерального штабу ЗСУ щодо грошових питань.',
        link: '/files/Генеральний_штаб_ЗСУ_грошове_Шаблон.docx',
    },
    {
        title: 'Запит на витяг з реєстру зниклих безвісти',
        description: 'Форма для запиту витягу з реєстру осіб, які зникли безвісти.',
        link: '/files/Запит_на_витяг_з_реєстру_зниклих_безвісти.pdf',
    },
    {
        title: 'Заява до МОУ про надання публічної інформації (грошове питання)',
        description: 'Зразок заяви до Міністерства оборони України щодо надання публічної інформації про грошові питання.',
        link: '/files/ЗАЯВА_МОУ_про_надання_публічної_інформації_про_ГЗ.docx',
    },
    {
        title: 'Заява до ТЦК та СП про заяву у військову частину',
        description: 'Шаблон заяви до ТЦК та СП для направлення заяви до військової частини.',
        link: '/files/Заява_на_ТЦК_та_СП_про_заяву_у_ВЧ.docx',
    },
    {
        title: 'Заява про нараховане депоноване грошове забезпечення до МОУ',
        description: 'Форма заяви про нараховане депоноване грошове забезпечення до Міністерства оборони України.',
        link: '/files/Заява_про_нараховане_депоноване_ГЗ_до_МОУ.docx',
    },
    {
        title: 'Звернення до Управління ЦВС Генштабу',
        description: 'Зразок звернення до Управління ЦВС Генштабу.',
        link: '/files/Звернення_до_Управління_ЦВС_Генштабу.docx',
    },
    {
        title: 'Звернення до КШ',
        description: 'Шаблон звернення до командування штабу.',
        link: '/files/Звернення_КШ.docx',
    },
    {
        title: 'Звернення до МВС',
        description: 'Форма звернення до Міністерства внутрішніх справ.',
        link: '/files/Звернення_МВС.docx',
    },
    {
        title: 'Звернення до МКЧХ',
        description: 'Шаблон листа до Міжнародного комітету Червоного Хреста.',
        link: '/files/Звернення_МКЧХ.docx',
    },
    {
        title: 'Звернення до МОУ',
        description: 'Форма звернення до Міністерства оборони України.',
        link: '/files/Звернення_МОУ.docx',
    },
    {
        title: 'Звернення до НІБ',
        description: 'Зразок звернення до Національного інформаційного бюро.',
        link: '/files/Звернення_НІБ.docx',
    },
    {
        title: 'Звернення до ОЦ СБУ',
        description: 'Шаблон звернення до Оперативного центру СБУ.',
        link: '/files/Звернення_ОЦ_СБУ.docx',
    },
    {
        title: 'Зразок звернення до МОУ та ГШ про ненадання документів службового розслідування',
        description: 'Шаблон звернення щодо ненадання документів службового розслідування.',
        link: '/files/Зразок_звернення_до_МОУ_та_ГШ_про_ненадан_докум_службов_розслідув.docx',
    },
    {
        title: 'Клопотання про стан кримінального провадження',
        description: 'Зразок клопотання про стан кримінального провадження або запиту до військової прокуратури.',
        link: '/files/клопот_про_стан_крим_пров_та_направл_запит_до_вч_про_служб_розслід_зразок.docx',
    },
    {
        title: 'Клопотання про передачу кримінального провадження',
        description: 'Шаблон клопотання про передачу кримінального провадження.',
        link: '/files/КЛОПОТАННЯ_про_передачу_кримінального_провадження.docx',
    },
    {
        title: 'Заява до Червоного Хреста (зразок)',
        description: 'Зразок заяви до Червоного Хреста.',
        link: '/files/лист_до_Червоного_Хреста_ЗРАЗОК.docx',
    },

    {
        title: 'Запит до Уповноваженого з питань осіб зниклих безвісти',
        description: 'Форма звернення до Уповноваженого з питань осіб, зниклих безвісти.',
        link: '/files/Уповноваженому_з_питань_осіб_зниклих_про_наявну_інформацію.docx',
    },
];


const DocumentsSection = () => {
    return (
        <div className="documents-section">
            <div className="documents-section-header">
                <h2 className="section-title">Як подати заяву щодо зниклих або постраждалих осіб</h2>
                <p className="section-description">
                    Цей розділ надає важливу інформацію та шаблони документів для подачі заяв щодо зниклих осіб або осіб, що постраждали внаслідок війни. Зразки документів включають звернення до органів державної влади.
                </p>
            </div>
            {documents.map((doc, index) => (
                <div className="document-item" key={index}>
                    <h3 className="document-title">{doc.title}</h3>
                    <p className="document-description">{doc.description}</p>
                    <a href={doc.link} className="download-link" target="_blank" rel="noopener noreferrer">
                        Завантажити {doc.title}
                    </a>
                </div>
            ))}

            <div className="instructions">
                <h3 className="instructions-title">Інструкції</h3>
                <p>1. Для подачі заяви на Лубінця або інших осіб заповніть відповідні поля в документах і подайте їх через офіційні канали.</p>
                <p>2. Для отримання підтвердження з фотографії вам потрібно подати фото високої якості. Якщо фото розмите або неякісне, вам можуть відмовити в наданні відповіді.</p>
            </div>
        </div>
    );
};

export default DocumentsSection;
