import './About.scss'

export const About = () => {
  return (
    <div className='aboutWrap'>
        <h2 className="aboutTitle">
        Чому важливо діяти зараз
        </h2>

        <div className="aboutDescWrap">
  <p className="aboutDesc">
    Кожна хвилина має значення у пошуку зниклих людей.  
    Чим раніше розпочато пошук, тим більше шансів на успішний результат.  
    Оперативні дії допомагають зібрати важливу інформацію, залучити свідків і підтримати родини у важкий час.
  </p>

  <p className="aboutDesc">
    Не відкладайте — кожна дія наближає до порятунку.
  </p>

  <p className="aboutDesc">
    Пам’ятайте: реальну різницю можемо зробити саме ми.  
    Державні служби, такі як поліція чи військкомати, часто працюють із перевантаженням і обмеженими ресурсами.  
    Тому об'єднання зусиль громадськості, волонтерів і близьких стає ключовим у пошуку.
  </p>

  <p className="aboutDesc">
    Наші дії сьогодні можуть врятувати чиєсь життя завтра.
  </p>
</div>

    
    </div>
  )
}
